nLog = require('nLog')()
require('faker')
require('xxtsp')



address ={
{"吴征明","贵州省安顺市蔡官镇新路口北斗小区2单元601室","13098532249",},
{"彭森生","福建省泉州市鲤城区侨乡商品1-313号","15280889719",},
{"任光翠","福建省泉州市惠安县海城园林天下8号楼805室","15280471856",},
{"维津","福建省泉州市惠安县峰崎村香格里茶业隔壁服装店","15880920275",},
{"袁田方","河南省周口市商水县袁庄乡","15559116895",},
{"吴梅","福建晋江青阳福隆广场1期5栋1712","18050979819",},
{"何玉雪","福建省泉州市惠安县海城园林天下","13459555934",},
{"维津","福建省泉州市惠安县峰崎村香格里茶业隔壁服装店","15880920275",},
{"张芳","福建省泉州市惠安县惠兴街漂亮E点理发店","18050925205",},
{"张芳","福建省泉州市惠安县惠兴街漂亮E点理发店","18050925205",},
{"吴梅","福建晋江青阳福隆广场1期5栋1712","18050979819",},
{"何玉雪","福建省泉州市惠安县海城园林天下","13459555934",},
{"维津","福建省泉州市惠安县峰崎村香格里茶业隔壁服装店","15880920275",},
{"任光翠","福建省泉州市惠安县海城园林天下8号楼805室","15280471856",},
{"阿林","福建省泉州市惠安县霞张红联幼儿园对面豆腐店","18359841128",},
{"贾静晓","上海市浦东新区川沙镇新川路768号","13511645365",},
{"郑伟杰","福建省泉州市惠安县辋川镇后许村村委会","15059504270",},
{"郑少杰","福建省漳州市漳浦县古雷区新港城9区12号2单元801","18960211900",},
{"何碧硕","福建省泉州市惠安县霞张红联幼儿园对面豆腐店","13489256752",},
{"烨彬","福建省泉州市惠安县海城园林天下8号楼805室","15285443712",},
{"袁田方","河南省周口市商水县袁庄乡","15559116895",},
{"何玉雪","福建省泉州市惠安县海城园林天下","13459555934",},
{"任光翠","福建省泉州市惠安县海城园林天下8号楼805室","15280471856",},
{"彭森生","福建省泉州市鲤城区侨乡商品1-313号","15280889719",},
{"贾静晓","上海市浦东新区川沙镇新川路768号","13511645365",},
{"维津","福建省泉州市惠安县峰崎村香格里茶业隔壁服装店","15880920275",},
{"吴征明","贵州省安顺市蔡官镇新路口北斗小区2单元601室","13098532249",},
{"张永庆","河南省周口市商水县平店乡","17643177054",},
{"玉凌","福建省泉州市惠安县惠兴街漂亮E点理发店","13489256320",},
{"吴梅","福建晋江青阳福隆广场1期5栋1712","18050979819",},
{"玉凌","福建省泉州市惠安县惠兴街漂亮E点理发店","13489256320",},
{"何碧硕","福建省泉州市惠安县霞张红联幼儿园对面豆腐店","13489256752",},
}

key = 1

input(address[key][1])
click(614, 243)
input(address[key][3])
click(357, 477)
input(address[key][2])





	
	