-- 此处为nLog功能实现操作
nLog = require('nLog')()

require('faker')
require('xxtsp')



address ={
	
	
{"力士沐浴露","彭森生","福建省泉州市鲤城区侨乡商品1-313号","15280889719",},
{"龙猫充电宝","贾静晓","上海市浦东新区川沙镇新川路768号","13511645365",},
{"美的电压力锅","维津","福建省泉州市惠安县峰崎村香格里茶业隔壁服装店","15880920275",},
{"浴巾","吴征明","贵州省安顺市蔡官镇新路口北斗小区2单元601室","13098532249",},
{"飞科剃须刀192","张永庆","河南省周口市商水县平店乡","17643177054",},
{"苏泊尔电压力锅2.5L","玉凌","福建省泉州市惠安县惠兴街漂亮E点理发店","13489256320",},
{"力士沐浴露","吴梅","福建晋江青阳福隆广场1期5栋1712","18050979819",},
{"美的电烤箱","玉凌","福建省泉州市惠安县惠兴街漂亮E点理发店","13489256320",},
{"苏泊尔电压力锅2.5L","何碧硕","福建省泉州市惠安县霞张红联幼儿园对面豆腐店","13489256752",},
{"小麦牙刷","吴征明","贵州省安顺市蔡官镇新路口北斗小区2单元601室","13098532249",},
{"美的电饭煲FS40174L","任光翠","福建省泉州市惠安县海城园林天下8号楼805室","15280471856",},
{"美的电烤箱","维津","福建省泉州市惠安县峰崎村香格里茶业隔壁服装店","15880920275",},
{"飞科剃须刀192","袁田方","河南省周口市商水县袁庄乡","15559116895",},
{"美的电磁炉2170","何玉雪","福建省泉州市惠安县海城园林天下","13459555934",},
{"电动车档披风","张芳","福建省泉州市惠安县惠兴街漂亮E点理发店","18050925205",},
{"美的电压力锅","吴梅","福建晋江青阳福隆广场1期5栋1712","18050979819",},
{"美的电饭煲FS40174L","何玉雪","福建省泉州市惠安县海城园林天下","13459555934",},
{"小麦牙刷","维津","福建省泉州市惠安县峰崎村香格里茶业隔壁服装店","15880920275",},
{"苏泊尔电压力锅2.5L","任光翠","福建省泉州市惠安县海城园林天下8号楼805室","15280471856",},
{"美的电磁炉2170","郑伟杰","福建省泉州市惠安县辋川镇后许村村委会","15059504270",},
{"浴巾","郑少杰","福建省漳州市漳浦县古雷区新港城9区12号2单元801","18960211900",},
{"苏泊尔电压力锅2.5L","何碧硕","福建省泉州市惠安县霞张红联幼儿园对面豆腐店","13489256752",},
{"穆家纺枕头3对","烨彬","福建省泉州市惠安县海城园林天下8号楼805室","15285443712",},
{"飞科剃须刀192","袁田方","河南省周口市商水县袁庄乡","15559116895",},
{"苏泊尔电压力锅2.5L","郑少杰","福建省泉州市惠安县海城园林天下","18960211900",},
{"美的电饭煲FS40174L","任光翠","福建省泉州市惠安县海城园林天下8号楼805室","15280471856",},
{"美的电磁炉2170","张芳","福建省泉州市惠安县惠兴街漂亮E点理发店","18050925205",},


}

t={}
t.搜索界面={{{44,84,0x4c4c4c},{568,82,0x5f5f5f},{563,70,0xfefefe},{137,80,0xeeeeee},},85}

key = 1

if d(t.搜索界面,"t.搜索界面")then
	input(address[key][1])
else
	input(address[key][2])
	click(614, 243)
	input(address[key][4])
	click(357, 477)
	input(address[key][3])
end






